Repository: nvda-es/nvda-proxy-support
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar, bg, de, hr, pl, ro

source: SOCKS v4
bg: SOCKS версия 4
de: SOCKS4

source: SOCKS v5
bg: SOCKS версия 5
de: SOCKS5

source: Proxy
ar: الوكيل
bg: Прокси
hr: Posrednik
pl: Serwer proxy

source: The following options allow you to configure a proxy server so NVDA can connect to the Internet
bg: Следните опции ви позволяват да конфигурирате прокси сървър, така че NVDA да може да се свързва с интернет
de: Mit den folgenden Optionen können Sie einen Proxy-Server konfigurieren, damit NVDA eine Verbindung mit dem Internet herstellen kann
hr: Sljedeće opcije omogućuju konfiguriranje posredničkog poslužitelja tako da se NVDA može povezati s internetom
pl: Poniższe opcje umożliwiają skonfigurowanie serwera proxy, aby NVDA mógł łączyć się z Internetem

source: All traffic
ar: كل حركة المرور
bg: Целият трафик
de: Alle Übertragungen
hr: Sav promet
pl: Cały ruch
ro: Tot traficul

source: SOCKS proxy type
ar: نوع الوكيل ل SOCKS
bg: Тип прокси SOCKS
de: SOCKS-Proxy-Typ
hr: Vrsta SOCKS posrednika
pl: Typ serwera proxy SOCKS
ro: Tipul SOCKS proxy

source: Host:
ar: الخادم:
bg: Хост:
hr: Računalo:
ro: Gazdă:

source: Port:
ar: المنفذ:
bg: Порт:
hr: Priključak:

source: Use proxy for DNS requests if possible
ar: استخدم الوكيل لطلبات DNS إن أمكن
bg: Използвай прокси за заявки за DNS, ако е възможно
de: Proxy für DNS-Anfragen verwenden, falls möglich
hr: Koristi posrednika za DNS zahtjeve, ako je moguće
pl: Jeśli to możliwe, używaj serwera proxy dla żądań DNS
ro: Utilizați proxy pentru solicitările DNS dacă este posibil

source: Username:
ar: المستخدم:
bg: Потребителско име:
de: Benutzername:
hr: Korisničko ime:
pl: Nazwa użytkownika:
ro: Nume de utilizator:

source: Password:
ar: كلمة المرور:
bg: Парола:
de: Passwort:
hr: Lozinka:
pl: Hasło:
ro: Parolă:

source: HTTP traffic
ar: حركة مرور HTTP
bg: HTTP трафик
de: HTTP-Übertragungen
hr: HTTP promet
pl: Ruch HTTP
ro: Traficul HTTP

source: HTTPS traffic
ar: حركة مرور HTTPS
bg: HTTPS трафик
de: HTTPS-Übertragungen
hr: HTTPS promet
pl: Ruch HTTPS
ro: Traficul HTTPS

source: FTP traffic
ar: حركة مرور FTP
bg: FTP трафик
de: FTP-Übertragungen
hr: FTP promet
pl: Ruch FTP
ro: Traficul FTP

source: Proxy support
ar: دعم الوكيل
bg: Поддръжка на прокси (Proxy support)
de: Proxy-Unterstützung
hr: Podrška za posrednika
ro: Asistență pentru proxy

source: This add-on allows NVDA connecting to the Internet through a proxy server.
ar: يمكّن هذا المكون الإضافي NVDA من الاتصال بالإنترنت من خلال خادم وكيل.
bg: Тази добавка позволява на NVDA да се свързва с интернет чрез прокси сървър.
de: Diese NVDA-Erweiterung ermöglicht eine Verbindung mit dem Internet über einen Proxy-Server.
hr: Ovaj dodatak omogućuje NVDA čitaču povezivanje na internet putem posredničkog poslužitelja.
pl: Ten dodatek umożliwia NVDA łączenie się z Internetem za pośrednictwem serwera proxy.
ro: Acest supliment permite conectarea la Internet a NVDA printr-un server proxy.

source: The following options allows you to configure a proxy server so NVDA can connect to the Internet
ar: تسمح لك الخيارات التالية بتهيئة خادم وكيل حتى يتمكن NVDA من الاتصال بالإنترنت
ro: Următoarele opțiuni vă permit să configurați un server proxy, astfel încât NVDA să se poată conecta la Internet
